Page({
  data: {
    questions: [{
      title: '1、休克发生的共同基础：（ ），决定有效循环血量和组织灌流量的三个因素。1（ ）,2正常的血管舒缩功能,3（ ）',
      chose: [],
      inputValue: ["","",""]
    },{
      title: '2、休克早期：神志（ ），伴有轻度兴奋、烦躁不安，血压正常，脉压差（ ），脉快、弱，呼吸（ ），尿量（ ）。',
      chose: [],
      inputValue: ["","","",""]
    },{
      title: '3、休克时神志反映（ ），皮肤温度及色泽反映（ ），血压持续下降，收缩压＜90mmHg，脉压差＜20mmHg，提示（ ）。尿量反映（ ），借此反映组织灌流量。神志淡漠或烦躁不安、嗜睡提示（ ）；四肢温暖、皮肤干燥、轻压红润 提示（ ）；四肢皮肤苍白、湿冷 、轻压迟缓提示休克无好转。',
      chose: [],
      inputValue: ["","","","","",""]
    },{
      title: '4、上消化道出血的临床表现有（ ）、（ ）、发热、氮质血症、（ ）。',
      chose: [],
      inputValue: ["","",""]
    },{
      title: '5、上消化道大量出血时常发生急性周围循环衰竭，其程度轻重因（ ）和（ ）而异。。',
      chose: [],
      inputValue: ["",""]
    },{
      title: '6、上消化道出血量的评估：大便隐血试验阳性每日消化道出血量（ ），出现黑粪消化道出血量为（ ），出现呕血消化道出血量为（ ），出现全身症状消化道出血量为（ ），出血周围循环衰竭消化道出血量为（ ）。',
      chose: [],
      inputValue: ["","","","",""]
    },{
      title: '7、大量出血后，多数患者在24小时内出现发热， 一般不超过（ ），持续（ ）天。',
      chose: [],
      inputValue: ["",""]
    },{
      title: '1、上消化道出血：',
      chose: [],
      inputValue: [],
      text: ""
    },{
      title: '2、休克：',
      chose: [],
      inputValue: [],
      text: ""
    },{
      title: '1、休克的观察要点？休克早期与休克抑制期如何区别？',
      chose: [],
      inputValue: [],
      text: ""
    },{
      title: '2、上消化道出血患者继续出血或再出血如何判断？',
      chose: [],
      inputValue: [],
      text: ""
    },{
      title: '3、休克的救治原则？',
      chose: [],
      inputValue: [],
      text: ""
    },{
      title: '4、如患者呕血过程中呕血突然停止，出现口唇、面色紫绀，神情恐怖……该患者病情出现什么变化？该怎样处理？',
      chose: [],
      inputValue: [],
      text: ""
    }],
  },
  onLoad() {},
  setOwerData(data) {
    // console.log("click");
    this.setData({
      questions: data
    });
  },
});
