Page({
  data: {
    questions:[]
  },
  onLoad(query) {
    var qData = [];
    var lx = query.lx;
    switch(query.lx){
      case '8':
        qData = [{
          title: '1、危重病人可根据( )、瞳孔、呼吸、心跳及总体情况等五个方面进行判断，护士须严密观察患者( )，对高危患者有预见性，及早发现( )，尽快采取( )。',
          chose: [],
          inputValue: ["", "", "", ""]
        },{
          title: '2、报告程序：危重患者突发病情变化，根据评估迅速组织( )、报告( )、护士长、科主任，必要时报告( )。或在发生医疗纠纷或可能发生医疗纠纷前兆时，通知医生及( )，迅速报告护理部、医务科或总值班，做好( )等文书工作。',
          chose: [],
          inputValue: ["", "", "", "", ""]
        },{
          title: '3、接诊危重患者：安全转到暂空床，注意保暖及保护隐私；连接( )各导联，测量( )；固定各管道并确保通畅；评估( )及生命体征。',
          chose: [],
          inputValue: ["", "", ""]
        },{
          title: '4、行心肺复苏：将患者摆放为复苏体位，解开( )及裤带，立即进行胸外按压( )次。去除义齿，清除口鼻腔内( )和异物，开放呼吸道，行人工呼吸( )次，进行( )个循环后再判断复苏是否有效。',
          chose: [],
          inputValue: ["", "", ""]
        },{
          title: '5、按分类要求在导管上贴醒目的标识，高危导管用( )标识，中危导管用( )标识，低危导管用白色标识，并在各标识空白处注明导管名称、( )、深度等重要信息，列入交班内容。',
          chose: [],
          inputValue: ["", "", ""]
        },{
          title: '6、床边交接班内容包括：( )、输液情况、( )、( )、仪器及特殊治疗、病人的情绪变化等。',
          chose: [],
          inputValue: ["", "", ""]
        },{
          title: '1、危重患者：',
          chose: [],
          inputValue: [],
          text: ""
        },{
          title: '1、一名重症患者突然发生病情变化，作为责任护士应如何处理？',
          chose: [],
          inputValue: [],
          text: ""
        },{
          title: '2、巡视病房时，患者主诉皮肤瘙痒，呼吸困难，心电监护显示P:106次/分，BP：86/49mmHg，SPO2：91%，患者正输头孢类药物，你应如何处理？',
          chose: [],
          inputValue: [],
          text: ""
        }];
        break;
      case '7':
        qData = [{
          title: '1、初始评估：凡( )、转入患者责任护士均需根据Barthel 指数 ADL 评估量表进行( )，评估当班完成。再评估：( )、手术后、出院时。',
          chose: [],
          inputValue: ["", "", ""]
        },{
          title: '2、	护士根据医嘱，并以患者病情和( )为依据，实施不同的( )。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '3、根据 Barthel 指数总分，将自理能力分为( )依赖：Barthel 指数总分≤40 分、中度依赖：Barthel 指数总分( )分、轻度依赖：Barthel 指数总分( )分和( )依赖:Barthel 指数总分100分四个等级，并提供相应生活照护。',
          chose: [],
          inputValue: ["", "", "", ""]
        },{
          title: '4、符合以下情况之一，可确定为二级护理：病情趋于( )或未明确诊断前仍需观察，且自理能力( )依赖的患者；病情稳定仍需( )，且自理能力( )依赖的患者；病情稳定或处于康复期，且自理能力( )依赖的患者。',
          chose: [],
          inputValue: ["", "", "", "", ""]
        },{
          title: '1、简述一级护理标准。',
          chose: [],
          inputValue: [],
          text: ""
        }];
        break;
      case '6':
        qData = [{
          title: '1、压疮评估方法：责任护士对新入科的每个患者进行( )初始评估，Braden 评分＞9分，≤18 分( )复评一次；Braden 评分≤9 分（特级护理≤12 分），( )评估一次，护理级别改变、病情变化( )评估。',
          chose: [],
          inputValue: ["", "", "", ""]
        },{
          title: '2、评估后发现压疮高危风险患者，汇报医生并要求在( )录入“高危压疮防范护理”，启用《压疮高危风险告知书》并( )，落实( )，做好( )，对特殊护理措施需要在护理记录单上记录。',
          chose: [],
          inputValue: ["", "", "", ""]
        },{
          title: '3、对于压疮患者，责任护士每班评估压疮( )，换药当日需要评估记录( )。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '4、预防压疮的方法：每天常规皮肤( )、记录；保持皮肤清洁、( )；采用措施防止或减少( )失禁周围皮肤的侵蚀；使用( )或预防压疮药物；适当营养支持。',
          chose: [],
          inputValue: ["", "", "", ""]
        },{
          title: '5、平卧位时压疮好发部位：枕部、肩胛、肘部、( )、( )。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '6、患者入院时初次进行压疮危险因素评估（Braden 评分），Braden 评分总分23 分，评分在 15-18 分提示( )；评分在 13-14 分提示( )；评分在 10-12 分提示高度危险；评分在 9 分以下提示极度危险。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '7、3期压疮表现：全皮肤层( ),全层皮肤缺失，但肌肉、肌腱和骨骼尚未暴露，可有( )、皮下隧道。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '1、压疮：',
          chose: [],
          inputValue: [],
          text: ""
        },{
          title: '1、简述1期压疮的临床表现及如何处理？',
          chose: [],
          inputValue: [],
          text: ""
        }];
        break;
      case '2':
        qData = [{
          title: '1、连续临床护理岗位指( )小时提供护理服务的临床护理岗位，如( )、( )、ICU等。',
          chose: [],
          inputValue: ["", "", ""]
        },{
          title: '2、独立上岗前评估：新护士经过( )、取得“护士执业证书”后并( )，护士长评估其独立上岗能力符合独立上岗要求，填写《护士独立上岗能力评价表》，经护理部讨论确认后才能独立上岗。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '3、护士执业注册有效期为( )年，在有效期届满前( )进行网上延续注册，确保依法执业。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '4、未取得( )的新入院护士不能( )，必须在( )的指导下进行护理工作；取得资格证书后，由本人进行( )，护理部予审核。',
          chose: [],
          inputValue: ["", "", "", ""]
        },{
          title: '5、每个岗位要有相应的( )，由护士长负责制订，并提交护理部审核通过。',
          chose: [],
          inputValue: [""]
        },{
          title: '6、每个护理岗位根据岗位工作量和专业需求配备不同( )和不同( )的护士。',
          chose: [],
          inputValue: ["", ""]
        },{
          title: '7、护士长根据科室和实际岗位与护士签署( )。',
          chose: [],
          inputValue: [""]
        },{
          title: '1、护士电子技术档案：',
          chose: [],
          inputValue: [],
          text: ""
        },{
          title: '1、我院有哪些护理岗位？',
          chose: [],
          inputValue: [],
          text: ""
        },{
          title: '2、有哪些科室/部门属于非连续性临床护理岗位？',
          chose: [],
          inputValue: [],
          text: ""
        }];
        break;
    }
    this.setData({
      questions: qData
    });
  },
  setOwerData(data) {
    // console.log("click");
    this.setData({
      questions: data
    });
  },
});
